/*********************************************************************
    程序名: 6． 完成编程练习5， 但这一次使用一个二维数组来存储输入—3年中每个月的销售量。 
				程序将报告每年销售量以及三年的总销售量。
    版权:
    作者: 大野狼
    日期: 2022/4/13-星期三 16:11:16
    说明:
*********************************************************************/
#include <iostream>
int main(void) {
	using namespace std;
	const int year=3;
	const int month=12;
	int total=0;
	int sale[year][month]={
		{1,1,1,1,1,1,1,1,1,1,1,1},
		{1,1,1,1,1,1,1,1,1,1,1,1},
		{1,1,1,1,1,1,1,1,1,1,1,10},
	}; 
	for(int row=0;row<year;++row)
	{
		for(int col=0;col<month;++col)
		{
			total += sale[row][col];
		}
	}
	cout<<total;
	return 0;
}

